results/four_gpus/Qwen2.5-7B/gpu_split_p_0_1_d_2_3_gpu_split_equal_prefill_tp2_pp1_decode_tp2_pp1/vllm_bench_serve/rate_32_input_1800_output_100.txt
Request Rate: 32
Input length: 1800, Output length: 100
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f7609f37ba0>, trust_remote_code=False, seed=0, num_prompts=1000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model=None, input_len=1800, output_len=100, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=32.0, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=200, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/Qwen2.5-7B/gpu_split_p_0_1_d_2_3_gpu_split_equal_prefill_tp2_pp1_decode_tp2_pp1/vllm_bench_serve', result_filename='rate_32_input_1800_output_100.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-ccedbc40-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Model not specified, fetching first model from server...
First model name: Qwen/Qwen2.5-7B, first model id: Qwen/Qwen2.5-7B
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 09-05 17:29:15 [utils.py:90] Sampling input_len from [1800, 1800] and output_len from [100, 100]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 200 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 32.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Failed requests during benchmark run detected (capping to 10):
Error 0: Bad Gateway
Error 1: Bad Gateway
Error 2: Bad Gateway
Error 3: Traceback (most recent call last):
  File "/.uv/python_install/cpython-3.13.15-linux-x86_64-gnu/lib/python3.13/asyncio/selector_events.py", line 1011, in _read_ready__data_received
    data = self._sock.recv(self.max_size)
ConnectionResetError: [Errno 104] Connection reset by peer

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/workspace/workload-aware-disaggregated-llm-serving/.venv/lib/python3.13/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 201, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
               ~~~~~~~~~~~~^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/workspace/workload-aware-disaggregated-llm-serving/.venv/lib/python3.13/site-packages/aiohttp/client.py", line 1693, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/workspace/workload-aware-disaggregated-llm-serving/.venv/lib/python3.13/site-packages/aiohttp/client.py", line 858, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/workspace/workload-aware-disaggregated-llm-serving/.venv/lib/python3.13/site-packages/aiohttp/client.py", line 836, in _connect_and_send_request
    await resp.start(conn)
  File "/workspace/workload-aware-disaggregated-llm-serving/.venv/lib/python3.13/site-packages/aiohttp/client_reqrep.py", line 558, in start
    message, payload = await protocol.read()  # type: ignore[union-attr]
                       ^^^^^^^^^^^^^^^^^^^^^
  File "/workspace/workload-aware-disaggregated-llm-serving/.venv/lib/python3.13/site-packages/aiohttp/streams.py", line 705, in read
    await self._waiter
aiohttp.client_exceptions.ClientOSError: [Errno 104] Connection reset by peer


                             Output tokens per second
  4500 +--------------------------------------------------------------------+
       |               *   *                                                |
  4000 |              **   **                     *                         |
       |     *        * * * *          *         * *                        |
  3500 |    * *      *  * *  *   *     ***       *  *     *                 |
       |   *   *    *   * *   *  **   *  *      *    *   * * ******         |
  3000 |   *    * **    * *   * * *   *   * *   *    * **   *     *         |
       |  *      *       *     **  * *    ** * *      *            *        |
  2500 |  *              *     *   ***    *  * *                   *        |
       |  *                                   *                     *       |
       | *                                                          *       |
  2000 | *                                                          *       |
       | *                                                           *      |
  1500 |*                                                            *      |
       |*                                                            *      |
  1000 |*                                                            *      |
       |                                                              *     |
   500 |                                                              *     |
       |                                                              *     |
     0 +--------------------------------------------------------------------+
       0         5         10        15       20        25        30        35

                          Concurrent requests per second
  120 +---------------------------------------------------------------------+
      |                                                                     |
      |    **                                                               |
  100 |   *  *      *                                                       |
      |   *   *    * **                                                     |
      |  *     ****    *                          *                         |
   80 |  *             * ****                    * *            *           |
      |  *              *    *        *         *   *    **    * *          |
      | *                     ***    * **      *     ****  ****   *         |
   60 | *                        * **    *   **                   *         |
      | *                         *       ***                      *        |
      |*                                                           *        |
      |*                                                            *       |
   40 |*                                                            *       |
      |                                                              *      |
      |                                                              *      |
   20 |                                                               *     |
      |                                                               *     |
      |                                                                *    |
    0 +---------------------------------------------------------------------+
      0         5         10        15        20        25        30        35
============ Serving Benchmark Result ============
Successful requests:                     996       
Failed requests:                         4         
Request rate configured (RPS):           32.00     
Benchmark duration (s):                  32.38     
Total input tokens:                      1792800   
Total generated tokens:                  99600     
Request throughput (req/s):              30.76     
Output token throughput (tok/s):         3076.22   
Peak output token throughput (tok/s):    4251.00   
Peak concurrent requests:                110.00    
Total token throughput (tok/s):          58448.16  
---------------Time to First Token----------------
Mean TTFT (ms):                          167.02    
Median TTFT (ms):                        160.03    
P99 TTFT (ms):                           288.69    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.52     
Median TPOT (ms):                        10.89     
P99 TPOT (ms):                           19.22     
---------------Inter-token Latency----------------
Mean ITL (ms):                           12.54     
Median ITL (ms):                         11.16     
P99 ITL (ms):                            33.74     
==================================================

===============================================================
GPU Utilisation Summary
===============================================================

Individual GPUs
---------------------------------------------------------------
GPU 0 (Prefill)
---------------------------------------------------------------
  Mean:   28.28%
  Median: 29.00%
  P90:    49.80%
  P95:    54.20%
  P99:    55.72%
  Max:    56.00%

GPU 1 (Prefill)
---------------------------------------------------------------
  Mean:   12.90%
  Median: 12.00%
  P90:    23.20%
  P95:    25.20%
  P99:    27.44%
  Max:    28.00%

GPU 2 (Decode)
---------------------------------------------------------------
  Mean:   83.97%
  Median: 91.50%
  P90:    100.00%
  P95:    100.00%
  P99:    100.00%
  Max:    100.00%

GPU 3 (Decode)
---------------------------------------------------------------
  Mean:   77.37%
  Median: 89.00%
  P90:    98.10%
  P95:    99.00%
  P99:    99.00%
  Max:    99.00%

Prefill GPUs (0, 1)
---------------------------------------------------------------
  Mean:   20.59%
  Median: 18.00%
  P90:    40.10%
  P95:    49.60%
  P99:    55.43%
  Max:    56.00%

Decode GPUs (2, 3)
---------------------------------------------------------------
  Mean:   80.67%
  Median: 91.00%
  P90:    100.00%
  P95:    100.00%
  P99:    100.00%
  Max:    100.00%
===============================================================